In [2]:
import pandas as pd
student=pd.read_csv("C:/Users/wel_home/Desktop/poori/campus placements.csv")
student

,NAME,DOB,CONTACT,YEAR,CAMPUS PLACEMENT,E-MAIL,READY TO CAMPUS
0,POORNIMA,19-10-1998,9440833509,1998,Y,POORNIMAREDDY345@GMAIL.COM,Y
1,PRATHIBHA,28-01-1997,9665623548,1997,Y,PRATHIBHAREDDY766@GMAIL.COM,Y
2,SIVA,01-03-1993,9000409898,1993,Y,SIVAREDDY@GMAIL.COM,Y
3,MAHESH,09-11-1995,9000500676,1995,Y,MAHESH@GMAIL.COM,Y
4,CHANDRA,24-07-1990,9856472356,1990,N,CHANDRA@GMAIL.COM,N
5,CHINNA,24-02-1992,9456236589,1992,Y,CHINNA@GMAIL.COM,Y
6,ADITHI,27-05-2016,9441520444,2016,Y,ADITHI@GMAIL.COM,Y

In [3]:
student["age"]=2020-student["YEAR"]
student

,NAME,DOB,CONTACT,YEAR,CAMPUS PLACEMENT,E-MAIL,READY TO CAMPUS,age
0,POORNIMA,19-10-1998,9440833509,1998,Y,POORNIMAREDDY345@GMAIL.COM,Y,22
1,PRATHIBHA,28-01-1997,9665623548,1997,Y,PRATHIBHAREDDY766@GMAIL.COM,Y,23
2,SIVA,01-03-1993,9000409898,1993,Y,SIVAREDDY@GMAIL.COM,Y,27
3,MAHESH,09-11-1995,9000500676,1995,Y,MAHESH@GMAIL.COM,Y,25
4,CHANDRA,24-07-1990,9856472356,1990,N,CHANDRA@GMAIL.COM,N,30
5,CHINNA,24-02-1992,9456236589,1992,Y,CHINNA@GMAIL.COM,Y,28
6,ADITHI,27-05-2016,9441520444,2016,Y,ADITHI@GMAIL.COM,Y,4

In [8]:
student[student["CAMPUS PLACEMENT"]=="Y"]

,NAME,DOB,CONTACT,YEAR,CAMPUS PLACEMENT,E-MAIL,READY TO CAMPUS
0,POORNIMA,19-10-1998,9440833509,1998,Y,POORNIMAREDDY345@GMAIL.COM,Y
1,PRATHIBHA,28-01-1997,9665623548,1997,Y,PRATHIBHAREDDY766@GMAIL.COM,Y
2,SIVA,01-03-1993,9000409898,1993,Y,SIVAREDDY@GMAIL.COM,Y
3,MAHESH,09-11-1995,9000500676,1995,Y,MAHESH@GMAIL.COM,Y
5,CHINNA,24-02-1992,9456236589,1992,Y,CHINNA@GMAIL.COM,Y
6,ADITHI,27-05-2016,9441520444,2016,Y,ADITHI@GMAIL.COM,Y

In [8]:
import pandas as pd
import numpy as np
data = {'name': ['Geetha', 'pavani', 'venkata ramana', 'abhi','manasa'],
        'age': [21,22, 20,22,23],
        'favorite_color': ['blue', 'yellow', 'white', 'green','pink'],
        'grade': [88, 92, 95, 70,66]}
df = pd.DataFrame(data, index = [0,1,2,3,4])
df

             name  age favorite_color  grade
0          Geetha   21           blue     88
1          pavani   22         yellow     92
2  venkata ramana   20          white     95
3            abhi   22          green     70
4          manasa   23           pink     66

# df['grade'].mean()

In [9]:
df['grade'].median()

88.0

In [10]:
df['grade'].mode()

0    66
1    70
2    88
3    92
4    95
dtype: int64

In [12]:
df['grade'].mean()

82.2

In [20]:
import pandas as pd
import numpy as np
data={"name":["karthik","poori","sudha","deepa"],
       "age":[20,30,28,15],
       "college":["adhisankar","merits","CBIT","IIIT"],
       "placement":["yes","yes","yes","no"]}
gf=pd.DataFrame(data,index=[0,1,2,3])
gf

      name  age     college placement
0  karthik   20  adhisankar       yes
1    poori   30      merits       yes
2    sudha   28        CBIT       yes
3    deepa   15        IIIT        no

In [22]:
gf["age"].median()

24.0

In [23]:
gf["age"].mean()

23.25

In [24]:
gf["age"].standard deviation()

SyntaxError: invalid syntax (<ipython-input-24-b3f10284eeb2>, line 1)